-- MySQL dump 10.13  Distrib 9.3.0, for macos15.2 (arm64)
--
-- Host: 127.0.0.1    Database: hps
-- ------------------------------------------------------
-- Server version	8.0.42

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `CheckBox`
--

DROP TABLE IF EXISTS `CheckBox`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `CheckBox` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `userId` int unsigned NOT NULL,
  `receiptIssuedAt` datetime DEFAULT NULL,
  `hasReceipt` datetime DEFAULT NULL,
  `isIncomeTracked` datetime DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `userId` (`userId`),
  CONSTRAINT `checkbox_ibfk_1` FOREIGN KEY (`userId`) REFERENCES `User` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `CheckBox`
--

LOCK TABLES `CheckBox` WRITE;
/*!40000 ALTER TABLE `CheckBox` DISABLE KEYS */;
INSERT INTO `CheckBox` VALUES (1,1,'2025-01-01 10:00:00','2025-02-01 10:00:00','2025-03-01 10:00:00'),(2,2,'2025-01-05 11:00:00','2025-02-05 11:00:00','2025-03-05 11:00:00'),(3,3,'2025-01-10 09:30:00','2025-02-10 09:30:00','2025-03-10 09:30:00'),(4,4,'2025-01-15 15:00:00','2025-02-15 15:00:00','2025-03-15 15:00:00'),(5,5,'2025-01-20 08:00:00','2025-02-20 08:00:00','2025-03-20 08:00:00'),(6,6,'2025-01-25 14:30:00','2025-02-25 14:30:00','2025-03-25 14:30:00'),(7,7,'2025-01-30 16:00:00','2025-02-28 16:00:00','2025-03-30 16:00:00'),(8,8,'2025-01-31 12:00:00','2025-02-27 12:00:00','2025-03-31 12:00:00'),(9,9,'2025-01-18 18:00:00','2025-02-18 18:00:00','2025-03-18 18:00:00'),(10,10,'2025-01-22 13:00:00','2025-02-22 13:00:00','2025-03-22 13:00:00');
/*!40000 ALTER TABLE `CheckBox` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `FixedExpense`
--

DROP TABLE IF EXISTS `FixedExpense`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `FixedExpense` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `expenseName` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `lastIncomeDate` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `lastAmount` int NOT NULL,
  `userId` int unsigned NOT NULL,
  PRIMARY KEY (`id`),
  KEY `userId` (`userId`),
  CONSTRAINT `fixedexpense_ibfk_1` FOREIGN KEY (`userId`) REFERENCES `User` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=9 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `FixedExpense`
--

LOCK TABLES `FixedExpense` WRITE;
/*!40000 ALTER TABLE `FixedExpense` DISABLE KEYS */;
INSERT INTO `FixedExpense` VALUES (1,'월세','2025-05-25 00:00:00',750000,1),(2,'통신비','2025-05-20 00:00:00',95000,1),(3,'건강보험','2025-05-10 00:00:00',130000,1),(4,'넷플릭스','2025-05-01 00:00:00',14500,1),(5,'클라우드요금','2025-05-03 00:00:00',33000,1),(6,'코워킹스페이스','2025-05-08 00:00:00',250000,1),(7,'웹사이트 호스팅','2025-05-12 00:00:00',11000,1),(8,'정기후원','2025-05-15 00:00:00',10000,1);
/*!40000 ALTER TABLE `FixedExpense` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `Salary`
--

DROP TABLE IF EXISTS `Salary`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `Salary` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `userId` int unsigned NOT NULL,
  `amount` int NOT NULL,
  `depositDate` datetime NOT NULL,
  `depositorName` varchar(63) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `incomeSource` varchar(63) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `userId` (`userId`),
  CONSTRAINT `salary_ibfk_1` FOREIGN KEY (`userId`) REFERENCES `User` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=3126 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Salary`
--

LOCK TABLES `Salary` WRITE;
/*!40000 ALTER TABLE `Salary` DISABLE KEYS */;
INSERT INTO `Salary` VALUES (1000,1,416887,'2024-01-17 08:01:59','업무지원센터','제휴처'),(1001,1,2014394,'2024-01-05 02:23:52','하나은행','하나은행'),(1002,1,376719,'2024-01-26 20:27:33','급여','크몽'),(1003,1,334760,'2024-02-04 10:14:39','에이전시입금','프리랜서'),(1004,1,981994,'2024-02-01 19:52:36','업무지원센터','제휴처'),(1005,1,873190,'2024-02-22 07:52:43','오픈페이','기타'),(1006,1,531882,'2024-02-08 19:10:59','헬로송금','헬로잡'),(1007,1,1092123,'2024-03-15 04:41:14','하나은행','하나은행'),(1008,1,364075,'2024-03-27 06:58:00','오픈페이','기타'),(1009,1,540146,'2024-03-16 08:51:26','에이전시입금','프리랜서'),(1010,1,688266,'2024-03-11 15:23:33','업무지원센터','제휴처'),(1011,1,408400,'2024-04-15 22:07:48','업무지원센터','제휴처'),(1012,1,329682,'2024-04-19 19:52:47','하나은행','하나은행'),(1013,1,755151,'2024-04-16 23:06:47','헬로송금','헬로잡'),(1014,1,617560,'2024-04-11 19:20:35','수고하셨어요','indiflex'),(1015,1,752598,'2024-05-11 11:59:15','카카오급여','카카오'),(1016,1,366276,'2024-05-23 04:22:50','헬로송금','헬로잡'),(1017,1,531396,'2024-05-04 13:39:00','급여','크몽'),(1018,1,1188746,'2024-05-27 03:28:29','스마트소득','스마트잡'),(1019,1,553097,'2024-06-01 23:21:22','카카오급여','카카오'),(1020,1,543849,'2024-06-04 00:05:45','에이전시입금','프리랜서'),(1021,1,854928,'2024-06-13 16:16:36','하나은행','하나은행'),(1022,1,1076915,'2024-06-09 13:13:13','㈜유튜브','유튜브'),(1023,1,724958,'2024-07-18 16:00:06','㈜유튜브','유튜브'),(1024,1,394130,'2024-07-12 05:01:53','카카오급여','카카오'),(1025,1,618685,'2024-07-09 11:23:15','하나은행','하나은행'),(1026,1,872934,'2024-07-18 11:28:43','헬로송금','헬로잡'),(1027,1,762654,'2024-07-03 16:46:07','급여','크몽'),(1028,1,876628,'2024-08-21 02:26:51','㈜유튜브','유튜브'),(1029,1,1024060,'2024-08-21 05:07:08','카카오급여','카카오'),(1030,1,425350,'2024-08-16 13:46:11','헬로송금','헬로잡'),(1031,1,430105,'2024-08-05 12:59:13','오픈페이','기타'),(1032,1,607760,'2024-09-11 15:01:18','㈜유튜브','유튜브'),(1033,1,555545,'2024-09-14 12:28:04','하나은행','하나은행'),(1034,1,1693902,'2024-09-14 19:18:51','에이전시입금','프리랜서'),(1035,1,1466048,'2024-10-23 00:27:50','스마트소득','스마트잡'),(1036,1,731127,'2024-10-20 09:45:03','하나은행','하나은행'),(1037,1,681582,'2024-10-15 21:11:21','오픈페이','기타'),(1038,1,366691,'2024-11-11 18:46:12','업무지원센터','제휴처'),(1039,1,669391,'2024-11-23 15:49:47','오픈페이','기타'),(1040,1,514665,'2024-11-02 09:07:09','스마트소득','스마트잡'),(1041,1,648523,'2024-11-15 00:38:03','하나은행','하나은행'),(1042,1,381976,'2024-11-10 21:55:20','수고하셨어요','indiflex'),(1043,1,933339,'2024-12-22 14:02:08','㈜유튜브','유튜브'),(1044,1,977338,'2024-12-24 23:07:47','오픈페이','기타'),(1045,1,868809,'2024-12-06 10:40:03','급여','크몽'),(1046,1,751479,'2024-12-28 10:13:57','에이전시입금','프리랜서'),(1047,1,872379,'2025-01-22 02:55:14','헬로송금','헬로잡'),(1048,1,836119,'2025-01-18 16:06:56','수고하셨어요','indiflex'),(1049,1,880452,'2025-01-01 07:41:15','스마트소득','스마트잡'),(1050,1,990515,'2025-01-12 19:37:58','㈜유튜브','유튜브'),(1051,1,560804,'2025-02-25 04:01:47','업무지원센터','제휴처'),(1052,1,1065535,'2025-02-04 02:05:47','오픈페이','기타'),(1053,1,780816,'2025-02-10 02:03:23','㈜유튜브','유튜브'),(1054,1,445402,'2025-02-28 00:34:02','하나은행','하나은행'),(1055,1,934393,'2025-03-16 20:43:09','카카오급여','카카오'),(1056,1,285333,'2025-03-20 05:15:00','스마트소득','스마트잡'),(1057,1,334088,'2025-03-16 10:22:25','㈜유튜브','유튜브'),(1058,1,497199,'2025-03-04 05:22:48','에이전시입금','프리랜서'),(1059,1,590953,'2025-03-23 07:18:26','헬로송금','헬로잡'),(1060,1,733243,'2025-04-19 07:31:52','㈜유튜브','유튜브'),(1061,1,737089,'2025-04-23 14:14:19','헬로송금','헬로잡'),(1062,1,913478,'2025-04-06 21:30:50','업무지원센터','제휴처'),(1063,1,451769,'2025-04-01 09:23:04','오픈페이','기타'),(1064,1,875806,'2025-04-06 09:18:13','수고하셨어요','indiflex'),(1065,1,716905,'2025-05-01 17:05:18','하나은행','(주)디자인펀치'),(1066,1,368324,'2025-05-17 22:23:54','카카오급여','유튜브'),(1067,1,160773,'2025-05-06 23:23:36','에이전시입금','인스타그램'),(1068,1,976528,'2025-05-21 03:01:45','오픈페이','광고'),(2000,2,300000,'2024-01-15 04:48:44','수고하셨어요','indiflex'),(2001,2,940778,'2024-01-17 19:30:09','하나은행','하나은행'),(2002,2,456956,'2024-01-20 08:02:16','스마트소득','스마트잡'),(2003,2,954431,'2024-01-28 16:03:45','업무지원센터','제휴처'),(2004,2,1020682,'2024-02-02 05:52:49','업무지원센터','제휴처'),(2005,2,581895,'2024-02-10 06:43:51','스마트소득','스마트잡'),(2006,2,509047,'2024-02-20 21:01:57','급여','크몽'),(2007,2,765908,'2024-03-23 01:42:54','카카오급여','카카오'),(2008,2,325826,'2024-03-01 09:43:54','급여','크몽'),(2009,2,518855,'2024-03-16 02:31:54','수고하셨어요','indiflex'),(2010,2,607478,'2024-03-11 16:16:11','헬로송금','헬로잡'),(2011,2,366009,'2024-04-02 16:42:11','카카오급여','카카오'),(2012,2,989260,'2024-04-11 04:58:58','업무지원센터','제휴처'),(2013,2,378632,'2024-04-01 16:44:24','에이전시입금','프리랜서'),(2014,2,300000,'2024-04-28 13:11:50','오픈페이','기타'),(2015,2,631746,'2024-05-19 07:36:14','급여','크몽'),(2016,2,914969,'2024-05-09 20:19:54','㈜유튜브','유튜브'),(2017,2,684426,'2024-05-22 22:37:12','업무지원센터','제휴처'),(2018,2,823029,'2024-05-04 07:16:17','하나은행','하나은행'),(2019,2,745265,'2024-06-25 15:22:02','카카오급여','카카오'),(2020,2,462965,'2024-06-12 04:15:39','헬로송금','헬로잡'),(2021,2,358989,'2024-06-28 16:54:39','오픈페이','기타'),(2022,2,871101,'2024-06-16 09:12:47','에이전시입금','프리랜서'),(2023,2,899369,'2024-07-25 15:55:44','카카오급여','카카오'),(2024,2,697983,'2024-07-22 03:55:06','헬로송금','헬로잡'),(2025,2,880758,'2024-07-08 01:08:17','㈜유튜브','유튜브'),(2026,2,859787,'2024-08-02 00:34:58','카카오급여','카카오'),(2027,2,772668,'2024-08-07 12:32:22','헬로송금','헬로잡'),(2028,2,760024,'2024-08-11 01:01:09','하나은행','하나은행'),(2029,2,1398132,'2024-09-01 07:10:29','급여','크몽'),(2030,2,496482,'2024-09-13 11:14:36','헬로송금','헬로잡'),(2031,2,596056,'2024-09-11 13:20:17','하나은행','하나은행'),(2032,2,794448,'2024-10-13 16:58:34','㈜유튜브','유튜브'),(2033,2,594469,'2024-10-15 14:14:17','수고하셨어요','indiflex'),(2034,2,300000,'2024-10-03 01:45:06','업무지원센터','제휴처'),(2035,2,389655,'2024-10-21 14:33:32','에이전시입금','프리랜서'),(2036,2,517871,'2024-10-13 13:23:15','헬로송금','헬로잡'),(2037,2,832111,'2024-11-10 23:32:43','업무지원센터','제휴처'),(2038,2,991091,'2024-11-18 01:11:53','급여','크몽'),(2039,2,300000,'2024-11-16 23:24:59','하나은행','하나은행'),(2040,2,345001,'2024-12-08 15:58:10','㈜유튜브','유튜브'),(2041,2,365908,'2024-12-20 20:39:27','에이전시입금','프리랜서'),(2042,2,1051698,'2024-12-22 19:34:29','스마트소득','스마트잡'),(2043,2,774978,'2024-12-08 02:57:21','카카오급여','카카오'),(2044,2,426676,'2024-12-07 21:21:55','오픈페이','기타'),(2045,2,1062380,'2025-01-28 22:39:02','스마트소득','스마트잡'),(2046,2,340462,'2025-01-28 03:08:08','수고하셨어요','indiflex'),(2047,2,287420,'2025-01-15 16:59:05','카카오급여','카카오'),(2048,2,411377,'2025-01-02 21:01:08','에이전시입금','프리랜서'),(2049,2,263648,'2025-01-17 21:39:45','하나은행','하나은행'),(2050,2,283075,'2025-02-16 09:31:10','급여','크몽'),(2051,2,650072,'2025-02-07 02:05:28','에이전시입금','프리랜서'),(2052,2,460584,'2025-02-11 10:57:44','헬로송금','헬로잡'),(2053,2,574019,'2025-02-21 03:38:25','스마트소득','스마트잡'),(2054,2,300000,'2025-02-09 08:42:21','㈜유튜브','유튜브'),(2055,2,721013,'2025-03-04 21:55:04','오픈페이','기타'),(2056,2,777331,'2025-03-02 10:58:32','수고하셨어요','indiflex'),(2057,2,354899,'2025-03-22 16:21:49','카카오급여','카카오'),(2058,2,978524,'2025-03-27 20:38:41','헬로송금','헬로잡'),(2059,2,827749,'2025-04-01 21:37:23','수고하셨어요','indiflex'),(2060,2,872026,'2025-04-02 06:47:33','카카오급여','카카오'),(2061,2,820674,'2025-04-27 15:16:26','㈜유튜브','유튜브'),(2062,2,822954,'2025-04-13 05:32:30','에이전시입금','프리랜서'),(2063,2,300000,'2025-04-22 01:25:04','스마트소득','스마트잡'),(2064,2,837341,'2025-05-25 21:17:08','카카오급여','광고'),(2065,2,1472000,'2025-05-24 20:28:20','하나은행','인스타그램'),(2066,2,521674,'2025-05-02 22:49:01','헬로송금','(주)디자인펀치'),(3000,3,378978,'2024-01-14 03:50:40','카카오급여','카카오'),(3001,3,1670402,'2024-01-27 21:21:10','㈜유튜브','유튜브'),(3002,3,394165,'2024-01-10 09:51:38','오픈페이','기타'),(3003,3,489532,'2024-02-14 01:02:17','에이전시입금','프리랜서'),(3004,3,335348,'2024-02-15 13:28:04','업무지원센터','제휴처'),(3005,3,1370613,'2024-02-14 14:31:37','급여','크몽'),(3006,3,558443,'2024-03-25 20:12:11','수고하셨어요','indiflex'),(3007,3,536325,'2024-03-06 19:39:06','하나은행','하나은행'),(3008,3,1252578,'2024-03-08 04:52:59','헬로송금','헬로잡'),(3009,3,404296,'2024-04-07 01:28:34','수고하셨어요','indiflex'),(3010,3,722362,'2024-04-03 05:39:35','에이전시입금','프리랜서'),(3011,3,497510,'2024-04-09 18:29:05','카카오급여','카카오'),(3012,3,993740,'2024-04-01 21:33:26','급여','크몽'),(3013,3,300000,'2024-04-03 00:36:48','하나은행','하나은행'),(3014,3,597497,'2024-05-26 13:34:17','급여','크몽'),(3015,3,778121,'2024-05-17 02:33:15','수고하셨어요','indiflex'),(3016,3,955101,'2024-05-04 20:53:00','카카오급여','카카오'),(3017,3,300000,'2024-05-18 07:41:41','업무지원센터','제휴처'),(3018,3,482614,'2024-06-16 13:25:01','수고하셨어요','indiflex'),(3019,3,967256,'2024-06-27 19:52:47','헬로송금','헬로잡'),(3020,3,1217406,'2024-06-27 02:23:17','스마트소득','스마트잡'),(3021,3,446916,'2024-07-22 00:29:02','㈜유튜브','유튜브'),(3022,3,396812,'2024-07-26 19:45:37','스마트소득','스마트잡'),(3023,3,407552,'2024-07-09 20:02:07','카카오급여','카카오'),(3024,3,756760,'2024-07-03 17:14:50','헬로송금','헬로잡'),(3025,3,300000,'2024-07-23 21:25:13','급여','크몽'),(3026,3,634901,'2024-08-14 09:45:51','오픈페이','기타'),(3027,3,359206,'2024-08-21 16:45:52','하나은행','하나은행'),(3028,3,1159080,'2024-08-23 23:00:44','급여','크몽'),(3029,3,833700,'2024-09-14 05:12:43','카카오급여','카카오'),(3030,3,300000,'2024-09-08 20:05:20','급여','크몽'),(3031,3,594692,'2024-09-04 14:48:29','하나은행','하나은행'),(3032,3,464470,'2024-09-19 13:23:19','업무지원센터','제휴처'),(3033,3,746596,'2024-09-19 13:01:02','㈜유튜브','유튜브'),(3034,3,967761,'2024-10-08 10:09:40','하나은행','하나은행'),(3035,3,645511,'2024-10-25 03:10:32','수고하셨어요','indiflex'),(3036,3,315072,'2024-10-08 20:50:45','헬로송금','헬로잡'),(3037,3,680388,'2024-10-17 08:40:47','스마트소득','스마트잡'),(3038,3,654160,'2024-11-03 07:20:51','하나은행','하나은행'),(3039,3,835504,'2024-11-21 22:01:28','급여','크몽'),(3040,3,321814,'2024-11-22 07:21:21','스마트소득','스마트잡'),(3041,3,538778,'2024-11-25 12:29:09','헬로송금','헬로잡'),(3042,3,565686,'2024-11-28 00:58:28','카카오급여','카카오'),(3043,3,694451,'2024-12-19 09:58:27','오픈페이','기타'),(3044,3,623602,'2024-12-06 00:06:49','스마트소득','스마트잡'),(3045,3,311382,'2024-12-08 13:04:10','업무지원센터','제휴처'),(3046,3,410848,'2024-12-06 05:02:06','헬로송금','헬로잡'),(3047,3,943884,'2025-01-27 05:11:36','스마트소득','스마트잡'),(3048,3,524596,'2025-01-11 09:53:29','카카오급여','카카오'),(3049,3,311679,'2025-01-06 23:14:37','오픈페이','기타'),(3050,3,356785,'2025-01-07 18:11:37','에이전시입금','프리랜서'),(3051,3,971040,'2025-02-13 16:36:02','㈜유튜브','유튜브'),(3052,3,706024,'2025-02-22 16:00:25','수고하셨어요','indiflex'),(3053,3,889840,'2025-02-19 14:06:53','헬로송금','헬로잡'),(3054,3,411596,'2025-02-03 00:02:40','하나은행','하나은행'),(3055,3,712149,'2025-03-21 03:06:06','급여','크몽'),(3056,3,1146777,'2025-03-01 08:38:33','오픈페이','기타'),(3057,3,511474,'2025-03-15 02:37:55','㈜유튜브','유튜브'),(3058,3,725895,'2025-04-19 21:13:47','하나은행','하나은행'),(3059,3,477322,'2025-04-07 15:44:03','수고하셨어요','indiflex'),(3060,3,914980,'2025-04-28 20:28:58','급여','크몽'),(3061,3,300000,'2025-04-12 14:23:41','오픈페이','기타'),(3062,3,747382,'2025-04-14 13:01:34','스마트소득','스마트잡'),(3063,3,777986,'2025-05-26 01:18:50','오픈페이','기타'),(3064,3,476555,'2025-05-05 18:46:16','㈜유튜브','유튜브'),(3065,3,962812,'2025-05-01 14:58:32','에이전시입금','프리랜서'),(3066,3,471365,'2025-05-16 21:37:22','카카오급여','카카오'),(3110,3,584930,'2025-06-02 19:09:44','틱톡',NULL),(3115,1,700000,'2025-06-25 13:02:37','수고하셨어요',NULL),(3116,1,1400000,'2025-06-11 15:09:44','인스타그램',NULL),(3117,1,98100,'2025-06-12 19:17:44','광고',NULL),(3118,1,500000,'2025-06-03 05:09:44','유튜브',NULL),(3119,1,888800,'2025-06-02 19:09:44','(주)디자인펀치',NULL),(3120,2,1400000,'2025-06-11 15:09:44','인스타그램',NULL),(3121,2,584930,'2025-06-02 19:09:44','틱톡',NULL),(3122,2,888800,'2025-06-02 19:09:44','(주)디자인펀치',NULL),(3123,2,98100,'2025-06-12 19:17:44','광고',NULL),(3124,3,888800,'2025-06-02 19:09:44','(주)디자인펀치',NULL),(3125,3,1120800,'2025-06-15 19:09:44','(주)블루웨일',NULL);
/*!40000 ALTER TABLE `Salary` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `User`
--

DROP TABLE IF EXISTS `User`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `User` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(31) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `loginId` varchar(60) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `password` varchar(60) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `createdAt` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `birthDate` varchar(8) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `businessCode` varchar(6) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=51 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `User`
--

LOCK TABLES `User` WRITE;
/*!40000 ALTER TABLE `User` DISABLE KEYS */;
INSERT INTO `User` VALUES (1,'User1','user1','$2b$10$n0lLQhOxhlvA2VhHItKimeKrSiz4U6CA2tKlI0JKU/3bjpdm4VWUG','2025-01-01 04:33:19','19901031','940909'),(2,'User2','user2','$2b$10$n0lLQhOxhlvA2VhHItKimeKrSiz4U6CA2tKlI0JKU/3bjpdm4VWUG','2025-04-19 04:33:19','19901031','940909'),(3,'User3','user3','$2b$10$n0lLQhOxhlvA2VhHItKimeKrSiz4U6CA2tKlI0JKU/3bjpdm4VWUG','2025-03-27 04:33:19','19901031',NULL),(4,'User4','user004@example.com','$2b$10$dummyhash004','2025-05-10 04:33:19','',NULL),(5,'User5','user005@example.com','$2b$10$dummyhash005','2024-07-08 04:33:19','',NULL),(6,'User6','user006@example.com','$2b$10$dummyhash006','2024-08-07 04:33:19','',NULL),(7,'User7','user007@example.com','$2b$10$dummyhash007','2025-02-07 04:33:19','',NULL),(8,'User8','user008@example.com','$2b$10$dummyhash008','2025-06-09 04:33:19','',NULL),(9,'User9','user009@example.com','$2b$10$dummyhash009','2024-06-24 04:33:19','',NULL),(10,'User10','user010@example.com','$2b$10$dummyhash010','2024-10-15 04:33:19','',NULL),(11,'User11','user011@example.com','$2b$10$dummyhash011','2025-06-08 04:33:19','',NULL),(12,'User12','user012@example.com','$2b$10$dummyhash012','2024-11-27 04:33:19','',NULL),(13,'User13','user013@example.com','$2b$10$dummyhash013','2024-11-26 04:33:19','',NULL),(14,'User14','user014@example.com','$2b$10$dummyhash014','2025-01-20 04:33:19','',NULL),(15,'User15','user015@example.com','$2b$10$dummyhash015','2024-12-10 04:33:19','',NULL),(16,'User16','user016@example.com','$2b$10$dummyhash016','2024-08-04 04:33:19','',NULL),(17,'User17','user017@example.com','$2b$10$dummyhash017','2025-02-24 04:33:19','',NULL),(18,'User18','user018@example.com','$2b$10$dummyhash018','2025-04-04 04:33:19','',NULL),(19,'User19','user019@example.com','$2b$10$dummyhash019','2025-03-26 04:33:19','',NULL),(20,'User20','user020@example.com','$2b$10$dummyhash020','2024-08-01 04:33:19','',NULL),(21,'User21','user021@example.com','$2b$10$dummyhash021','2025-04-27 04:33:19','',NULL),(22,'User22','user022@example.com','$2b$10$dummyhash022','2025-01-23 04:33:19','',NULL),(23,'User23','user023@example.com','$2b$10$dummyhash023','2024-11-05 04:33:19','',NULL),(24,'User24','user024@example.com','$2b$10$dummyhash024','2024-06-23 04:33:19','',NULL),(25,'User25','user025@example.com','$2b$10$dummyhash025','2024-12-23 04:33:19','',NULL),(26,'User26','user026@example.com','$2b$10$dummyhash026','2024-09-18 04:33:19','',NULL),(27,'User27','user027@example.com','$2b$10$dummyhash027','2025-05-08 04:33:19','',NULL),(28,'User28','user028@example.com','$2b$10$dummyhash028','2024-10-09 04:33:19','',NULL),(29,'User29','user029@example.com','$2b$10$dummyhash029','2024-12-15 04:33:19','',NULL),(30,'User30','user030@example.com','$2b$10$dummyhash030','2024-10-01 04:33:19','',NULL),(31,'User41','user041@example.com','$2b$10$dummyhash041','2024-07-28 04:33:19','',NULL),(32,'User42','user042@example.com','$2b$10$dummyhash042','2025-03-09 04:33:19','',NULL),(33,'User43','user043@example.com','$2b$10$dummyhash043','2024-12-14 04:33:19','',NULL),(34,'User44','user044@example.com','$2b$10$dummyhash044','2024-12-04 04:33:19','',NULL),(35,'User45','user045@example.com','$2b$10$dummyhash045','2025-05-16 04:33:19','',NULL),(36,'User46','user046@example.com','$2b$10$dummyhash046','2024-06-24 04:33:19','',NULL),(37,'User47','user047@example.com','$2b$10$dummyhash047','2024-08-25 04:33:19','',NULL),(38,'User48','user048@example.com','$2b$10$dummyhash048','2024-09-08 04:33:19','',NULL),(39,'User49','user049@example.com','$2b$10$dummyhash049','2024-12-10 04:33:19','',NULL),(40,'User50','user050@example.com','$2b$10$dummyhash050','2025-04-15 04:33:19','',NULL);
/*!40000 ALTER TABLE `User` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping routines for database 'hps'
--
